'''
为了小说排序
让中文数字转换成
阿拉伯数字
没有考虑千万的转换
因为小说章节并没有那么多章节
'''


numDic = {
    '零': '0',
    '一': '1',
    '二': '2',
    '三': '3',
    '四': '4',
    '五': '5',
    '六': '6',
    '七': '7',
    '八': '8',
    '九': '9',
    '0': '0',
    '1': '1',
    '2': '2',
    '3': '3',
    '4': '4',
    '5': '5',
    '6': '6',
    '7': '7',
    '8': '8',
    '9': '9',
}


def Ch2Num(name):
    num = ''
    for char in name:
        if char in numDic.keys():
            num += numDic[char]
    return num


print(Ch2Num('第1158章'))
